src/InformationRegisters/ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Comment>notification_name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗвонящийНомер</Name>
					<Comment>called_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВызываемыйНомер</Name>
					<Comment>calling_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Comment>start_time (YYYY-MM-DD hh:mm:ss.ttt)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>total_time_duration</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Comment>wait_time_duration</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Comment>virtual_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Входящий</Name>
					<Comment>direction=in</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСессии</Name>
					<Comment>call_session_id: (10-11 цифр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияЗвонков/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура СсылкаНаЗаписьОткрытие(Элемент, СтандартнаяОбработка)
	
	Если СтрНайти(Запись.СсылкаНаЗапись, "http") > 0 Тогда 
		СтандартнаяОбработка = Ложь;	
		Попытка  // Доступен, начиная с версии 8.3.18.
			Результат = ЗапуститьПриложениеАсинх( Запись.СсылкаНаЗапись ); // открывает браузер по-умолчанию и открывает файл
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "НЕ удалось открыть запись по ссылке: " + Запись.СсылкаНаЗапись + "
			| " + ОписаниеОшибки();
			Сообщение.Сообщить(); 
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Послать сервер
//
// Параметры:
//  стр	 - Структура - структура полей для отправки Centrifugo 
// 
// Возвращаемое значение:
//  булево - признак удачной отправки
//
&НаСервере
Функция ПослатьСервер(стр) 

	Удачно = CentrifugoСервер.ПослатьСообщениеНаКанал( стр );
 
	стр.Канал = ?(стр.Канал = "", CentrifugoСервер.ПолучитьКаналПоНомеру(стр.Номер), стр.Канал); 
	стр.Отправлен = Удачно;

Возврат Удачно;
КонецФункции

&НаКлиенте
Процедура Послать(Команда)  
	стрЗвонка = Новый Структура("Номер, Входящий, Канал, ЗвонящийНомер, ВызываемыйНомер, Отправлен",
									"", Истина, 	"", 			"",				 "", Ложь);
	ЗаполнитьЗначенияСвойств( стрЗвонка, Запись ); 

	Отправлен = ПослатьСервер(стрЗвонка);  

	ЗаполнитьЗначенияСвойств(Запись, стрЗвонка);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ?(Отправлен, "УСПЕШНО ", "НЕ") 
						+ " отправлено сообщение: " + Запись.ЗвонящийНомер 
						+ " в Канал: " + Запись.Канал;
	Сообщение.Поле = "ЗвонящийНомер"; 
	Сообщение.Сообщить();
	
КонецПроцедуры
